"""
Task_1_3
По введенным пользователем координатам двух точек вывести уравнение прямой вида y = kx + b, проходящей через эти точки.
"""
print('Введите коордионаты 2-х точек A и B')
x1 = int(input('Введите коордионату x1: '))
y1 = int(input('Введите коордионату y1: '))
x2 = int(input('Введите коордионату x2: '))
y2 = int(input('Введите коордионату y2: '))
if y1 == y2:
    print(f'y = {y1}')
elif x1 == x2:
    print(f'x = {x1}')
else:
    k = round((y1 - y2) / (x1 - x2), 2)
    b = round((y2 - k * x2), 2)
    if b >= 0:
        print(f'y = {k}x + {b}')
    else:
        print(f'y = {k}x {b}')

